[
    {
        "id": 3,
        "path": "23-03-2024",
        "title": "Brain Worms, a two-person exhibition featuring Pieter Schoolwerth and Keith Tilford",
        "date": "May 26th, 2024",
        "html": "<p>We are thrilled to announce <em>Brain Worms</em> featuring Pieter Schoolwerth and Keith tilford.</p><p>The press release may be <a href=\"/exhibitions/brain-worms/\" target=\"_blank\">accessed online here</a>, or in <a href=\"/docs/brain-worms/brain-worms-release.pdf\" target=\"_blank\">PDF format</a>.</p><p>The exhibition will open on June 8th, with a reception from 6-9PM and will run from June 8th to July 27th, 2024. Gallery hours are 1:00PM to 6:00PM, Wednesday through Saturday or by appointment.</p>"
    },
    {
        "id": 3,
        "path": "23-03-2024",
        "title": "The Veil featuring Sam Bornstein, Aisling Hamrogue, Nicholas Moenich, Kate Steciw",
        "date": "March 23rd, 2024",
        "html": "<p>We are pleased to announce <em>The Veil</em> featuring Sam Bornstein, Aisling Hamrogue, Nicholas Moenich, Kate Steciw.</p><p>The press release may be <a href=\"/exhibitions/the-veil/\" target=\"_blank\">accessed online here</a>, or in <a href=\"/docs/veil/veil-press-release.pdf\" target=\"_blank\">PDF format</a>.</p><p>The exhibition will open on April 5th, with a reception from 6-9PM and will run from April 5th to May 25th, 2024. Gallery hours are 1:00PM to 6:00PM, Wednesday through Saturday or by appointment.</p>"
    },
    {
        "id": 10,
        "path": "9-3-2024",
        "title": "Amanda Beech: Delphic Future extended",
        "date": "March 9th, 2024",
        "html": "<p>We are pleased to announce that Amanda Beech: Delphic Future will be extended through to Saturday, March 23rd. The gallery hours are 1:00PM to 6:00PM, Wednesday through Saturday or by appointment.</p>"
    },
    {
        "id": 9,
        "path": "28-2-2024",
        "title": "Amanda Beech and Ellis von Sternberg in conversation",
        "date": "February 28th, 2024",
        "html": "<p>Ellis von Sternberg has interviewed Amanda Beech regarding her recent work and the exhibition at Twelve Ten Gallery. The full interview may be <a href=\"/documents/beech-von-sternberg-interview\">accessed online here</a>, or in <a href=\"/docs/delphic-future/beech-evs-interview.pdf\" target=\"_blank\">PDF format</a></p>"
    },
    {
        "id": 8,
        "path": "14-1-2024",
        "title": "Amanda Beech: Delphic Future",
        "date": "January 14th, 2023",
        "html": "<p>Twelve Ten Gallery is pleased to present new paintings and drawings by Amanda Beech, accompanied by an installation of the video work <em>Covenant Transport Move or Die</em> (2015) and a special one-night US premiere of her 2022 film <em>Map of the Bomb</em> (commissioned by Fieldwork Marfa). The press release may be <a href=\"/exhibitions/beech-delphic-future/\" target=\"_blank\">accessed online here</a>, or in <a href=\"/docs/delphic-future/delphic-future-press-release.pdf\" target=\"_blank\">PDF format</a>.</p><p>The exhibition will open on Sunday, February 4th, with a reception from 5-8PM. <em>Map of the Bomb</em> will be presented at the <a href=\"https://www.musicboxtheatre.com/\" target=\"_blank\">Music Box Theatre</a> on Tuesday, February 6th from 7-9PM and will be followed by a brief discussion with the artist. Free and open to the public as capacity allows.<p><p>The exhibition will run from February 4th to March 16th, 2024. Gallery hours are 1:00PM to 6:00PM, Wednesday through Saturday or by appointment.</p>"
    },
    {
        "id": 7,
        "path": "6-1-2024",
        "title": "Bullet Hell closing and curator walkthrough with curator David Mitchell",
        "date": "January 6th, 2023",
        "html": "<p>Last week to see \"Bullet Hell\" before it closes on January 12th. As a final celebration of the show and artists, we will host a special walkthrough with curator David Mitchell, where he will share his insights into the exhibition, and what inspired the connection between the works on view. Refreshments will be available.</p><p>\"Bullet Hell\" featuring Sam Dickey, Helmut Hammen, Trey Rozell is open Wed-Sat. 1-6PM through Friday, January 12th, 2024.</p>"
    },
    {
        "id": 6,
        "path": "17-12-2023",
        "title": "Holiday Hours",
        "date": "December 17th, 2023",
        "html": "<p>The gallery will be closed for the holiday beginning the week of December 18th and resume normal hours on December 27th. Our current exhibition, Bullet Hell, featuring Sam Dickey, Helmut Hammen, and Trey Rozell, curated by David Mitchell will be on view until January 12th.</p>"
    },
    {
        "id": 5,
        "path": "15-12-2023",
        "title": "Bullet Hell reviewed by Annette LePique for Newcity",
        "date": "December 15th, 2023",
        "html": "<p>We are very grateful to Annette LePique for writing an astute review of Bullet Hell for Newcity art:</p><p><em>\"Bullet Hell\", currently up at Twelve Ten Gallery, takes the titular gaming genre as the point of departure for the work of Sam Dickey, Helmut Hammen and Trey Rozell, alongside the exhibition text created by curator David Mitchell, to consider the position of the individual in much larger systems of power and knowledge. The contours of this \"I,\" for which the viewer stands proxy, are captured in a state of flux; for knowledge, the very process of knowing, the center's raw material is inextricably linked to the often overwhelming amount of information that subsumes us. The ethical consequences of this fragmentation are damning and cyclical, for we begin in Mitchell's text as a victim of a firing squad and end, once more at the beginning, but now the gun is in our hands. The trigger always cocked, the safety always off.</em></p><p><a href=\"https://art.newcity.com/2023/12/15/you-were-always-complicit-a-review-of-bullet-hell-at-twelve-ten-gallery/\" target=\"_blank\">Read the full review here.</a></p>"
    },
    {
        "id": 4,
        "path": "12-11-2023",
        "title": "Speedrunners reviewed by Chicago Spleen",
        "date": "November 12th, 2023",
        "html": "<p>Thank you to Chicago Spleen for a thoughtful review of our inaugral exhibition featuring Isabelle Frances McGuire, Ryan Nault, Liz Vitlin, and Ellis & Parker von Sternberg:</p><p><em>&quot;If you want to make it, you have to play the game.&quot; We all have been guilty of saying or thinking this at some point. The freedom of play that is presupposed by Art in theory is often inversely proportional to the freedom (time and money) that would allow one to successfully play in the gamified sphere of Contemporary Art in practice. Speedrunners, the first show at Edgewater's Twelve Ten gallery features Chicago mainstays Isabelle Frances McGuire, Ryan Nault, and Liz Vitlin alongside New York's Ellis and Parker von Sternberg. The exhibition highlights a certain way of making that maliciously complies to the de facto rules we all follow through our participation in art and life.</em></p><p><a href=\"https://chicagospleen.substack.com/p/isabelle-frances-mcguire-ryan-nault?utm_source=profile&utm_medium=reader2\" target=\"_blank\">Read the full review here.</a></p>"
    },
    {
        "id": 3,
        "path": "04-11-2023",
        "title": "Sam Dickey, Helmut Hammen, & Trey Rozell in 'Bullet Hell', curated by David Mitchell",
        "date": "November 4th, 2023",
        "html": "<p>We are excited to announce <em>Bullet Hell</em> featuring Sam Dickey, Helmut Hammen and Trey Rozell, curated by David Mitchell.</p><p>The press release may be <a href=\"/exhibitions/bullet-hell/\" target=\"_blank\">accessed online here</a>, or in <a href=\"/docs/bullethell/bullethell-press-release.pdf\" target=\"_blank\">PDF format</a>.</p><p>The exhibition will open on November 17th, with a reception from 6-9PM and will run from November 17th to January 12th, 2024. Gallery hours are 1:00PM to 6:00PM, Wednesday through Saturday or by appointment.</p>"
    },
    {
        "id": 2,
        "path": "10-10-2023",
        "title": "Hosting the Brooklyn Institute for Social Reaserch",
        "date": "October 10th, 2023",
        "html": "<p>We are pleased to announce a partnership with the <a href=\"https://thebrooklyninstitute.com/\" target=\"_blank\">Brooklyn Institute for Social Research</a>! Coming this November, we will begin hosting their first in-person course for the Chicago area:</p><div class=\"align-left\"><a href=\"https://thebrooklyninstitute.com/items/courses/critical-theory-and-the-now-a-contemporary-introduction-to-the-frankfurt-school-in-person/\" target=\"_blank\"><img src=\"/images/bisr/bisr-crit-theory-flier.png\" /></a></div><p><a class=\"font-bold\" href=\"https://thebrooklyninstitute.com/items/courses/critical-theory-and-the-now-a-contemporary-introduction-to-the-frankfurt-school-in-person/\" target=\"_blank\">Critical Theory and the Now: a Contemporary Introduction to the Frankfurt School</a><br />Instructor: Audrey Nicolaides<br />Thursday, 6:30-9:30pm CT<br />November 16 — December 14, 2023<br />4 sessions over 5 weeks<br />Class will not meet Thursday, November 23rd.<br /></p><p>In 1930, Max Horkheimer became the director of the Institute for Social Research in Frankfurt, Germany. Along with his colleagues and a broader orbit of external scholars, he inaugurated the first wave of what came to be called “critical theory.” This course is an introduction to some of the key works and concepts of the Frankfurt School, including thinkers like Horkheimer, Theodor Adorno, and Walter Benjamin, in the context of a comparative analysis of the cultural and political landscape of the mid-twentieth century and that of today. What is historical materialism? What is the “dialectic of enlightenment”? How does the “culture industry” work? What, if any, are the connections and boundaries between philosophy sociology, aesthetics, art, history, and religion? Drawing on readings from several Frankfurt School texts, particularly Adorno and Horkheimer's <em>Dialectic of Enlightenment</em>, we will attempt to read, understand, and evaluate these questions and link them to the contemporary world.</p><p><a href=\"https://thebrooklyninstitute.com/items/courses/critical-theory-and-the-now-a-contemporary-introduction-to-the-frankfurt-school-in-person/\" target=\"_blank\">More information and enrollment here</a></p>"
    },
    {
        "id": 1,
        "path": "07-09-2023",
        "title": "Inaugural Exhibition: Speedrunners",
        "date": "September 7th, 2023",
        "html": "<p>We are excited to announce our inaugural exhibition, <em>Speedrunners</em> featuring Isabelle Frances McGuire, Ryan Nault, Liz Vitlin, and Ellis &amp; Parker von Sternberg.</p><p>The press release may be <a href=\"/exhibitions/speedrunners/\" target=\"_blank\">accessed online here</a>, or in <a href=\"/docs/speedrunners/speedrunners-press-release.pdf\" target=\"_blank\">PDF format</a>.</p><p>The exhibition will open on September 29th, with a reception from 6-9PM and will run from September 29th to November 11th, 2023. Gallery hours are 1:00PM to 6:00PM, Wednesday through Saturday or by appointment.</p>"
    },
    {
        "id": 0,
        "path": "19-08-2023",
        "title": "Preparing for launch at our new location in Chicago",
        "date": "August 19th, 2023",
        "html": "<p>We are pleased to announce that we will be opening at 1210 Thorndale Ave., Chicago IL 60660 soon! Sign up to our mailing list for more details about our inaugural show, upcoming exhibits, artists, and more.</p>"
    }
]
